In [2]:
import numpy as np
import pandas as pd

<img src = "photo.png">

In [5]:
sales_amount = np.array([
                        [2,1,2,1],
                       [2,4,1,2],
                       [1,2,3,4],
                       [1,2,3,1],
                       [2,1,3,1],
                       [5,1,3,5],
                       [5,2,4,6]
                        ])

In [7]:
sales_amount.ndim, sales_amount.size

(2, 28)

In [8]:
prices = np.array([100, 500, 50, 50])
prices

array([100, 500,  50,  50])

In [9]:
weekly_sales = pd.DataFrame(sales_amount,
                           index=["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"],
                           columns = ["Phone", "Laptop", "Speaker", "Lights"])
weekly_sales

           Phone  Laptop  Speaker  Lights
Monday         2       1        2       1
Tuesday        2       4        1       2
Wednesday      1       2        3       4
Thursday       1       2        3       1
Friday         2       1        3       1
Saturday       5       1        3       5
Sunday         5       2        4       6

In [10]:
prices.shape

(4,)

In [11]:
shop_prices = pd.DataFrame(prices.reshape(1,4),
                          index=["Price"],
                          columns=["Phone", "Laptop", "Speaker", "Lights"])
shop_prices

       Phone  Laptop  Speaker  Lights
Price    100     500       50      50

In [12]:
sales_amount.size

28

In [13]:
prices.size

4

In [18]:
total_sales = np.dot(sales_amount, prices)
total_sales

array([ 850, 2350, 1450, 1300,  900, 1400, 2000])

In [19]:
weekly_sales["Total ($)"] = total_sales
weekly_sales

           Phone  Laptop  Speaker  Lights  Total ($)
Monday         2       1        2       1        850
Tuesday        2       4        1       2       2350
Wednesday      1       2        3       4       1450
Thursday       1       2        3       1       1300
Friday         2       1        3       1        900
Saturday       5       1        3       5       1400
Sunday         5       2        4       6       2000

In [20]:
shop_prices

       Phone  Laptop  Speaker  Lights
Price    100     500       50      50

<img src = "photo.png">

In [25]:
weekly_total = np.sum(total_sales)
weekly_total

np.int64(10250)